{
	"projects": 
	[
		[
			{
				"Title": "The Good Dinosaur: Dino Crossing",
				"Year": "2015",
				"Company": "CerebralFix",
				"Environment": "Unity3D",
				"Languages": "C#",
				"Link": "https://itunes.apple.com/nz/app/good-dinosaur-dino-crossing/id995564126?mt=8",
				
				"Overview":
				[
					"A 3 month game development project consisting of a team of developers, artists and designers. This project was in collaboration with Disney – the final output consisting of a production quality game in correspondence with ‘The Good Dinosaur (Disney, 2016)’ movie.",
					"The flexible nature of agile methodology allowed development to respond to frequent changes. Accompanying the fundamental game elements, considerations for optimisation, design/balance, and testing allowed for a stable build throughout production.",
					"The final delivery was of great success with positive reception and feedback; a challenging and rewarding experience alongside an enjoyable product."
				],
		
				"ImageSource": "https://lh3.googleusercontent.com/bMuzvVdy7_0kMxm1nJbbUGkuQ6Ep4r9YT1SxyqJ24MVciPINE_yYp5P1k4UzJw_oGng=h900"
			},
			{
				"Title": "Simon Slots",				
				"Year": "2015",
				"Company": "CerebralFix",
				"Environment": "Unity3D",
				"Languages": "C#",
				"Link": "",
				
				"Overview":
				[
					"A 1 month game development prototype, operating as a solo developer with 2 supporting artists. For this particular project, the goal was to introduce a gamified element within a gambling environment. These two distinct fields were new to our research so determining whether such a demographic existed would establish some beneficial traction.",
					"A large part of this product was largely process oriented, development consuming approximately 2 weeks with usability and testing being the primary focus. Subjecting the game to a specified audience allowed for quick changes in response to feedback.",
					"This experiment was a strong window into the prototyping methodology, the views and information learned proving extremely valuable."
				],
		
				"ImageSource": "https://unity3d.com/profiles/unity3d/themes/unity/images/company/brand/logos/primary/unity-logo-white.png"
			}
		],
		[
			{
				"Title": "Colourfall",				
				"Year": "2016",
				"Company": "",
				"Environment": "Android SDK",
				"Languages": "Java, XML",
				"Link": "",
				
				"Overview":
				[
					"A passion for exploring new technologies, personal motivation was directed at exploring the tools involved with professional and scalable apps, in particular Android SDK. A 2-week application development project aimed at learning the core elements of Android SDK, the final product: a colour palette generator and visualiser.",
					"Fundamental basics such as Layout, Views/ViewGroups, Activities, Resources, and Project Structure were all covered to a comfortable understanding. A pivotal moment within the project was understanding the concept of MVC structure. Being able to separate logic into 3 principal states allowed for clean communication across the app, a rewarding experience to led by improved understanding.",
					"Overall, this project was a small yet valuable spike in knowledge, alongside practical output for personal benefit."
				],
		
				"ImageSource": "assets/images/colourfall.png"
			},
			{
				"Title": "Personal online portfolio",				
				"Year": "2016",
				"Company": "",
				"Environment": "",
				"Languages": "HTML, CSS, SCSS, JavaScript, jQuery, AngularJS",
				"Link": "",
				
				"Overview":
				[
					"Having no initial exposure to web development technologies, this website was aimed to learn the core languages while producing a functional product to support. By allocating one week to learn the basics; HTML, CSS and JavaScript were understood to a comfortable level.",
					"Timeboxing the website for a feature complete deliverable within two weeks was a reasonable goal of size and scope. Very little disruptions effected the project, conversely, adopting new frameworks (in this case jQuery and SCSS) assisted production significantly. Polish, aesthetic and behaviour are a work in progress, prioritising the functional and navigational elements.",
					"Exploring new areas in web development technologies, AngularJS was definitely something to look at in parallel with the website. Improvements to this project include structure, further cross browser considerations and dynamic sizing/layout."
				],
		
				"ImageSource": "https://d13yacurqjgara.cloudfront.net/users/32742/screenshots/1009938/files-html_-css_-php_-js.jpg"
			},
			{
				"Title": "Title",				
				"Year": "Year",
				"Company": "Company",
				"Environment": "Environment",
				"Languages": "Languages",
				"Link": "",
				
				"Overview":
				[
					"Overview1",
					"Overview2",
					"Overview3"
				],
		
				"ImageSource": "assets/images/test.jpg"
			}
		],
		[
			{
				"Title": "Medikidz",	
				"Company": "Medikidz",
				"Year": "2014",
				"Environment": "Unity3D",
				"Languages": "C#",
				"Link": "",
				
				"Overview":
				[
					"A 32 week game production consisting of a team of artists and programmers. This project was in collaboration with Medikidz – a global initiative set up by doctors to explain medical information to children. A fundamental goal of prototyping an education oriented game, the intention of this product was to communicate medicinal areas of knowledge within a gaming medium.",
					"The primary content were of Medikidz instruction, allowing the team to interpret the supporting elements with modest freedom. Following the initial criteria, the team proceeded into the standard milestones of development. The final delivery was of overall success, a rewarding experience with further industry prospect."
				],
		
				"ImageSource": "http://www.medikidz.com/gb-en/wp-content/uploads/2014/11/TD17-392x600.jpg"
			},
			{
				"Title": "Capstone Project - Genetic Algorithms",				
				"Year": "2014",
				"Environment": "Unity3D",
				"Languages": "C#",
				"Link": "",
				
				"Overview":
				[
					"A report covering a basic implementation of Genetic Algorithm (GA) – a search heuristic that mimics the process of natural selection.",
					"Genetic algorithms are representative of the behaviour that occurs in natural selection, and are therefore somewhat replicative of the process that occurs. GA’s can be applied to any problem/solution search space so long as the core elements evaluated with the environment; in this case a path finding navigator.",
					"This was a fun and interesting project, combining unique elements of software engineering between two fields."
				],
		
				"ImageSource": "assets/images/genetic_algorithm.png"
			}
		]
	]
}